{
	"English": {
		"heroTitle": "Find the best Web Tutorials",
		"intro_Title": "Introduction",
		"intro_Summary": "Summary",
		"intro_Text1": "Codify is a website built through a group project. It initially aimed at creating a small multi-page website displaying content and show off a compelling and responsive design, layout along with some technical skills we learnt in the class.<br> As a group, we decided to build a website about tutorials with detailed sections and explanations.",
		"intro_Text2": "The project began around the end of November and lasted until the beginning of February.",
		"goals_Title": "My Goals",
		"goals_Text": "In this group of 3 people, I was in charge of 2 pages as well as the following tasks:",
		"goals_List1": "Page: Light &amp; Dark Theme",
		"goals_List2": "Page: Hamburger Menu",
		"goals_List3": "Website: Light &amp;Dark Theme",
		"goals_List4": "Website: Hamburger Menu",
		"goals_List5": "Website: Responsiveness",
		"lightDark_Title": "Light &amp; Dark Theme | Hamburger Menu",
		"lightDark_Structure": "Structure of the page",
		"lightDark_Structure_Text1": "For each page, it is structured according to the following order and elements:",
		"lightDark_Structure_List1": "An article about the topic",
		"lightDark_Structure_List2": "A tutorial section",
		"lightDark_Structure_Text2": "First, I made some reasearch about the light/dark theme and hamburger menu. I read some articles to understand the pros and cons using these design choices that are really popular nowadays. I tried to make it short and easy enough to understand as it is a tutorial.<br>",
		"tutorialSection_Title": "Tutorial Section",
		"tutorialSection_Text1": "After some explanation on the topic, I had to create a section dedicated to anyone that would like to create its own light/dark theme. The objective here was to explain the different steps that lead me to get this result.<br>",
		"tutorialSection_Text2": "I splited the tutorial section into 3 parts according to the different technologies I used:",
		"tutorialSection_Text3": "And lastly, I ended this page with a section that allows people to test everything according to the explanations given above.<br> This section is the result they should obtain after copy-pasting the code given in the sections above.",
		"checkWebsite_Button": "Check out the website !",
		"technology_Title": "Technology used in the project"
	},
	"Français": {
		"heroTitle": "Trouvez les meilleurs tutoriels du web",
		"intro_Title": "Introduction",
		"intro_Summary": "Résumé",
		"intro_Text1": "Codify est un site réalisé via un projet de groupe. Cela avait pour objectif de créer un petit site avec plusieurs pages montrant du contenu et démontrant un design attractif et responsif ainsi qu'une configuration attestant de compétences techniques apprises en classe.<br> Le groupe a décidé de construire ce site dédié aux tutoriels avec des sections et explications détaillées.",
		"intro_Text2": "Le projet a commencé autou de fin novembre et duré jusqu'à début février.",
		"goals_Title": "Mes objectifs",
		"goals_Text": "Dans ce groupe, j'ai été chargé de 2 pages ainsi que des missions suivantes :",
		"goals_List1": "Page: Thème Clair &amp; Sombre",
		"goals_List2": "Page: Menu Hamburger",
		"goals_List3": "Site: Thème Clair &amp; Sombre",
		"goals_List4": "Site: Menu Hamburger",
		"goals_List5": "Site: Responsivité",
		"lightDark_Title": "Thème Clair &amp; Sombre | Menu Hamburger",
		"lightDark_Structure": "Structure de la page",
		"lightDark_Structure_Text1": "Pour chaque page, cela a été structuré selon l'ordre et les éléments suivants :",
		"lightDark_Structure_List1": "Un article à propos du sujet",
		"lightDark_Structure_List2": "Une section tutoriel",
		"lightDark_Structure_Text2": "Tout d'abord, j'ai effectué quelques recherches sur les thèmes clair/sombre et le menu hamburger. J'ai lu quelques articles afin de comprendre les avantages et les inconvénients d'utiliser ces choix de design qui sont plutôt populaires de nos jours. J'ai essayé de le rendre court et simple à comprendre étant donné que c'est un tutoriel.<br>",
		"tutorialSection_Title": "Section Tutoriel",
		"tutorialSection_Text1": "Après quelques explications sur le sujet, j'ai crée une section dédiée à n'importe qui souhaitant créer son propre thème clair/sombre. L'objectif ici était d'expliquer les différentes étapes qui m'ont guidées jusqu'à ce résultat.<br>",
		"tutorialSection_Text2": "J'ai divisé la section tutoriel en 3 parties selon les différentes technologies que j'ai utilisées :",
		"tutorialSection_Text3": "Enfin, j'ai terminé cette page avec une section qui permet aux personnes de tout tester par eux-mêmes selon les explications données en amont.<br> Cette section est le résultat qu'ils devraient obtenir après avoir copié-collé le code données dans les sections au-dessus.",
		"checkWebsite_Button": "Allez voir le site !",
		"technology_Title": "Technologies utilisées dans le projet"
	},
    "日本語": {
        "heroTitle": "最良のウェブチュートリアルが見つかります！",
		"intro_Title": "紹介",
		"intro_Summary": "概要",
		"intro_Text1": "Codifyはプロジェクトグループを通して作成されたウェブサイトです。当初の目的は内容を表示する複数ページのウェブサイトを作成し、クラスで技術的なスキルを学ぶと共に魅力とレスポンシブなデザイン、レイアウトを見せることです。グループとして詳しいセクションと説明チュートリアルについてのウェブサイトを作成することにしました。",
		"intro_Text2": "このプロジェクトは11月の月末くらいに始まって、2月の月初めまで続きました。",
		"goals_Title": "目標",
		"goals_Text": "3人のグループに、2ページを担当して、次のような務めも担当しました。",
		"goals_List1": "ページ : ライトモードとダークモード",
		"goals_List2": "ページ : ハンバーガーメニュー",
		"goals_List3": "ウェブサイト : ライトモードとダークモード",
		"goals_List4": "ウェブサイト : ハンバーガーメニュー",
		"goals_List5": "ウェブサイト : レスポンシブ的",
		"lightDark_Title": "ライトモードとダークモード | ハンバーガーメニュー",
		"lightDark_Structure": "ページの構造",
		"lightDark_Structure_Text1": "全てのページは次のような順とエレメントに構造しております。",
		"lightDark_Structure_List1": "トピックについての記事",
		"lightDark_Structure_List2": "チュートリアルセクション",
		"lightDark_Structure_Text2": "最初はライトモードとダークモードとハンバーガーメニューについて調べてみました。近頃人気のあるデザインの選択を使うことの可否を理解するために記事を読みました。チュートリアルなので短くて分かりやすいように努めました。<br>",
		"tutorialSection_Title": "チュートリアルセクション",
		"tutorialSection_Text1": "トピックについて説明の後で誰でも自分のライトモードとダークモードを作成したいことに関してセクションを作成しなければいけませんでした。目的はこの結果を得るまでの複数ステップを説明することでした。<br>",
		"tutorialSection_Text2": "使用した様々な言語によって3つの部分でチュートリアルセクションを分けました。",
		"tutorialSection_Text3": "最後には人が上の説明によって全部を試すことができるセクションでこのページを終わらせました。<br> このセクションは上のセクションにあるコードをコピーアンドペーストした後で得られる結果です。",
		"checkWebsite_Button": "ウェブサイトをチェックしてください！",
		"technology_Title": "プロジェクトに使用した技術"
    }
}